Repository: voronsoft/Child-PC-Guard
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: uk

source: Child PC Guard - АДМИНИСТРАТОР
uk: Child PC Guard - АДМІНІСТРАТОР

source: Child PC Guard - ПОЛЬЗОВАТЕЛЬ
uk: Child PC Guard - КОРИСТУВАЧ

source: Выбор языка интерфейса
uk: Вибір мови інтерфейсу

source: Просмотр логов программы
uk: Перегляд логів програми

source: Открыть окно таймера
uk: Відкрити вікно таймера

source: Мониторинг
uk: Моніторинг

source: Включить-отключить мониторинг
uk: Увімкнути-вимкнути моніторинг

source: Очистить
uk: Очистити

source: Очистить все
uk: Очистити все

source: Удаляет все данные задания для блокировки. БЛОКИРОВКУ НЕ ОТКЛЮЧАЕТ
uk: Видаляє всі дані завдання блокування. БЛОКУВАННЯ НЕ ВІДКЛЮЧАЄ

source: Разблокировать
uk: Розблокувати

source: Разблокировать пользователя
uk: Розблокувати користувача

source: Открывает окно разблокировки пользователя
uk: Відкриває вікно розблокування користувача

source: Справка
uk: Довідка

source: Открывает окно по использованию программы
uk: Відкриває вікно з використання програми

source: Оповещение
uk: Оповіщення

source: Открывает окно для настройки оповещения через Telegram
uk: Відкриває вікно для оповіщення через Telegram

source: Разблокировать интерфейс
uk: Розблокувати інтерфейс

source: Заблокировать интерфейс
uk: Заблокувати інтерфейс

source: Блокировка интерфейса
uk: Блокування інтерфейсу

source: Укажите пользователя для блокировки:
uk: Вкажіть користувача для блокування:

source: Укажите время для блокировки:
uk: Вкажіть час для блокування:

source: час (0 отключено)
uk: годину (0 вимкнено)

source: Осталось времени до блокировки:
uk: Залишилося часу до блокування:

source: Отключить блокировку
uk: Вимкнути блокування

source: Программа CPG была выключена
uk: Програму CPG було вимкнено

source: Предупреждение
uk: Попередження

source: Запуск задания блокировки
uk: Запуск завдання блокування

source: Внимание убедитесь что вы выбрали не АДМИНИСТРАТОРА !!! Только АДМИНИСТРАТОР может снять блокировку !!!. В противном случае блокировку уже не снять. РЕШЕНИЕ - ПЕРЕУСТАНОВКА WINDOWS !!!
uk: Увага переконайтеся, що ви вибрали не АДМІНІСТРАТОРА !!! Тільки АДМІНІСТРАТОР може зняти блокування !!!. В іншому випадку блокування вже не зняти. РІШЕННЯ - ПЕРЕУСТАНОВКА WINDOWS !!!

source: Вы не указали пользователя для отключения блокировки.
uk: Ви не вказали користувача для вимкнення блокування.

source: Блокировка для пользователя отключена: {usermane}
uk: Блокування для користувача вимкнено: {usermane}

source: Ошибка
uk: Помилка

source: Мониторинг запущен
uk: Моніторинг запущено

source: Программа мониторинга запущена в фоновом режиме
uk: Програму моніторингу запущено у фоновому режимі

source: Настройки программы сброшены через кнопку в интерфейсе
uk: Налаштування програми скинуто через кнопку в інтерфейсі

source: Настройки программы сброшены!
uk: Налаштування програми скинуто!

source: СБРОС ДАННЫХ
uk: СКИДАННЯ ДАНИХ

source: Кто то пытается разблокировать интерфейс программы Пароль не совпал
uk: Хтось намагається розблокувати інтерфейс програми Пароль не збігся

source: Интерфейс программы разблокирован
uk: Інтерфейс програми розблоковано

source: ОШИБКА
uk: ПОМИЛКА

source: Доступ к мьютексу запрещен.
uk: Доступ до м'ютексу заборонено.

source: Неизвестная ошибка: {error_code}
uk: Невідома помилка: {error_code}

source: В системе всего один пользователь, приложение не будет работать!! Необходимо, что-бы в системе было два пользователя. 1- Администратор 2- Пользователь/Администратор Необходимо создать второго пользователя. После этого программа запустится.
uk: В системі всього один користувач, програма не буде працювати!! Необхідно, щоб у системі було два користувача. 1- Адміністратор 2- Користувач/Адміністратор Необхідно створити другого користувача. Після цього програма запуститься.

source: ВВЕДИТЕ ПАРОЛЬ
uk: Введіть пароль

source: Не задан пароль для главного приложения. Откройте главное приложение и задайте пароль для главной программы. Потом вернитесь и введите пароль опять, что-бы получить доступ
uk: Не вказано пароль для головної програми. Відкрийте головну програму та введіть пароль для головної програми. Потім поверніться і введіть пароль знову, щоб отримати доступ

source: Неверный пароль. Попробуйте снова.
uk: Неправильний пароль. Спробуйте ще раз.

source: АДМИНИСТРАТОР
uk: АДМІНІСТРАТОР

source: НЕТ ПРАВ администратора
uk: НЕМАЄ ПРАВ адміністратора

source: Нет заблокированных
uk: Немає заблокованих

source: Успешно
uk: Успішно

source: Осталось времени
uk: Залишилося часу

source: Выключен
uk: Вимкнено

source: Ошибка считывания времени. Таймер будет закрыт. Повторный запуск таймера может исправить проблему
uk: Помилка прочитування часу. Таймер буде закрито. Повторний запуск таймера може виправити проблему

source: Настройка оповещения через Telegram
uk: Налаштування оповіщення через Telegram

source: В этом окне, вам нужно ввести ID вашего чата с ботом программы. 1- Откройте Telegram и в строке поиска введите: Child Pc Guard Bot или @ChildPCGuard_bot 2- Для начала беседы нужно ввести /start или нажать кнопку Старт если она есть на экране. 3- После этого вы получите сообщение от бота:
uk: У цьому вікні потрібно ввести ID вашого чату з ботом програми. 1- Відкрийте Telegram і введіть у рядку пошуку: Child Pc Guard Bot або @ChildPCGuard_bot 2- Для початку розмови потрібно ввести /start або натиснути кнопку Старт, якщо вона є на екрані. 3- Після цього ви отримаєте повідомлення від робота:

source: Ваш chat_id: хххххххххх Этот номер вам нужно ввести в программе - Child PC Guard Нажав на кнопку в меню - 'Подключить оповещения через - Telegram' Введите номер в поле для ввода и нажмите - ОК После этого программа сможет понять кому отправлять сообщения
uk: Ваш chat_id: хххххххххх Цей номер потрібно ввести в програмі - Child PC Guard Натиснувши кнопку в меню - 'Підключити оповіщення через - Telegram' Введіть номер у полі для введення та натисніть - ОК Після цього програма зможе зрозуміти кому надсилати повідомлення

source: 4- Введите номер в поле что ниже и нажмите ОК. 5- После этого программа будет присылать вам оповещение. 6- Что бы получить доступ к меню бота, введите пароль от этой программы.
uk: 4- Введіть номер у поле нижче і натисніть ОК. 5- Після цього програма буде надсилати вам оповіщення. 6- Щоб отримати доступ до меню бота, введіть пароль від цієї програми.

source: Ваш chat_id: (номер который вам выдаст бот)
uk: Ваш chat_id: (номер, який вам видасть бот)

source: ID записан в БД Бот Telegram запущен и настроен для уведомлений о работе программы
uk: ID записаний у БД Робот Telegram запущено та налаштовано для повідомлень про роботу програми

source: Ошибка ID может содержать только цифры
uk: Помилка ID може містити лише цифри

source: Документация
uk: Документація

source: ТЕКСТ ЗАПОЛНИТЕЛЬ - документация в разработке
uk: ТЕКСТ ЗАПОВНИК - документація у розробці

source: ВЫХОД из программы
uk: ВИХІД із програми

source: Закрыв программу таймер программы будет отключен.
uk: Закривши програму таймер програми буде вимкнено.

source: Отмена
uk: Скасування

source: Настройка программы
uk: Налаштування програми

source: Если фон главного окна КРАСНОГО цвета, значит программа запущена без прав АДМИНИСТРАТОРА. Необходимо перезапустить программу от имени АДМИНИСТРАТОРА
uk: Якщо фон головного вікна ЧЕРВОНОГО кольору, отже програма запущена без прав адміністратора. Необхідно перезапустити програму від імені Адміністратора

source: Введите пароль для приложения
uk: Введіть пароль для програми

source: Выберите пользователя которого НЕЛЬЗЯ БЛОКИРОВАТЬ
uk: Виберіть користувача якого НЕ МОЖНА БЛОКУВАТИ

source: Язык приложения:
uk: Мова програми:

source: Пароль ЗАПИСАН в программу. Пользователь ЗАПИСАН в программу Язык программы - {lng}
uk: Пароль ЗАПИСАНО в програму. Користувач ЗАПИСАН у програму Мова програми - {lng}

source: ОТЛИЧНО
uk: ВІДМІННО

source: Вы не выбрали пользователя которого нельзя блокировать
uk: Ви не обрали користувача, якого не можна блокувати

source: Пароль уже есть в БД
uk: Пароль вже є у БД

source: Пароль не может быть меньше пять знаков
uk: Пароль не може бути меншим за п'ять знаків

source: Выбор языка
uk: Вибір мови

source: Перезапустите приложение что бы настройки языка вступили в силу.
uk: Перезапустіть програму щоб налаштування мови набрали чинності.

source: ВХОД
uk: ВХІД

source: Выход
uk: Вихід

source: Ваш chat_id: {chat_id} Этот номер вам нужно ввести в программе - Child PC Guard Нажав на кнопку в меню - 'Подключить оповещения через - Telegram' Введите номер в поле для ввода и нажмите - ОК После этого программа сможет понять кому отправлять сообщения
uk: Ваш chat_id: {chat_id} Цей номер потрібно ввести в програмі - Child PC Guard Натиснувши кнопку в меню - 'Підключити оповіщення через - Telegram' Введіть номер у полі для введення та натисніть - ОК Після цього програма зможе зрозуміти кому надсилати повідомлення

source: Введите пароль для доступа (тот который вы вводили в программе):
uk: Введіть пароль для доступу (той який ви вводили у програмі):

source: Доступ разрешен.
uk: Доступ дозволено.

source: Получить статус CPG
uk: Отримати статус CPG

source: Вывести предупреждение
uk: Вивести попередження

source: Выключить и заблокировать ПК
uk: Вимкнути та заблокувати ПК

source: Разблокировать ПК
uk: Розблокувати ПК

source: Выбрать время для блокировки
uk: Вибрати час для блокування

source: 1 час
uk: 1 година

source: 2 часа
uk: 2 години

source: 3 часа
uk: 3 години

source: 4 часа
uk: 4 години

source: 5 часов
uk: 5 годин

source: Выберите время для блокировки:
uk: Виберіть час для блокування:

source: Вы выбрали: {time_selected} часа(ов) до блокировки. Таймер начал отсчет времени! Как только время выйдет, вы получите уведомление.
uk: Ви вибрали: {time_selected} години(ів) до блокування. Таймер розпочав відлік часу! Як тільки час вийде, ви отримаєте сповіщення.

source: Устрашающее сообщение выведено на главном экране.
uk: Жахливе повідомлення виведено на головному екрані.

source: Вы не авторизованы. Введите пароль.
uk: Ви не авторизовані. Введіть пароль.

source: Пожалуйста, введите текст для сообщения.
uk: Введіть текст для повідомлення.

source: Работает
uk: Працює

source: Выключено
uk: Вимкнено

source: Не найдено
uk: Не знайдено

source: Не включено
uk: Не ввімкнено

source: Отключено
uk: Вимкнено

source: СТАТУС ПРОГРАММЫ: - CPG: {status_cpg} - Пользователь: {user_status} - Таймер: {timer_status} - Оповещение Telegram: {bot_status}
uk: СТАТУС ПРОГРАМИ: - CPG: {status_cpg} - Користувач: {user_status} - Таймер: {timer_status} - Оповіщення Telegram: {bot_status}

source: Пользователь {username} разблокирован.
uk: Користувача {username} розблоковано.

source: ПК будет выключен через 30 секунд.
uk: ПК буде вимкнено через 30 секунд.

source: Выключить приложение
uk: Вимкнути програму

source: Приложение выключено. Все настройки стерты. Таймер остановлен. БЛОКИРОВКА НЕ СНЯТА
uk: Програму вимкнено. Усі налаштування стерті. Таймер зупинено. БЛОКУВАННЯ НЕ ЗНЯТО

source: Включить приложение
uk: Увімкнути програму

source: Приложение включено.
uk: Додаток увімкнено.

source: Выбранный пользователь: {usermane} не вошел в свой аккаунт Windows. РЕШЕНИЕ: 1 - Нужно зайти в его аккаунт. 2 - Запустить программу от имени АДМИНИСТРАТОРА 3 - Провести процедуру настройки блокировки снова.
uk: Вибраний користувач: {usermane} не увійшов до свого облікового запису Windows. РІШЕННЯ: 1 - Потрібно зайти до його облікового запису. 2 - Запустити програму від імені Адміністратора 3 - Провести процедуру налаштування блокування знову.

source: Пользователь '{username}' заблокирован.
uk: Користувач '{username}' заблоковано.

source: Команда не будет выполнена. Не назначен пользователь для блокировки перед выключением ПК
uk: Команда не буде виконана. Перед вимкненням ПК не призначено користувача для блокування

source: Введите это имя для подтверждения блокировки и выключения ПК:
uk: Введіть це ім'я для підтвердження блокування та вимкнення ПК:

source: Пользователь {username} будет заблокирован. ПК будет выключен через 30 секунд.
uk: Користувач {username} буде заблоковано. ПК буде вимкнено через 30 секунд.

source: Имя пользователя указано неверно. Отмена операции.
uk: Ім'я користувача неправильне. Скасування операції.

source: Имя пользователя который будет заблокирован: {usr_act_ses}
uk: Ім'я користувача, який буде заблоковано: {usr_act_ses}

source: Этот пользователь защищен от блокировки. Отмена операции.
uk: Цей користувач захищений від блокування. Скасування операції.
